Repository: 84000/data-translation-memory
Catalog: toh138_84000-the-ratnaketu-dharani.tmx
Source language: bo
Languages: en

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་ཁྱོད་ཀྱི་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་གྱི་ཚིག་བརྗོད་པ་བྱིན་གྱི་རླབས་ཀྱིས་ཁྱོད་སྤོབས་པར་གྱིས་ཤིག །དེ་ནས་ཚངས་པ་ཕུན་སུམ་ཚོགས་པའི་དབང་ཕྱུག་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་ཐལ་མོ་སྦྱར་ཏེ།
en: The maṇḍala of sound that conveys words , O noble son, has now been made available to you through the blessing of the thus-gone ones. Express your eloquence.”

source: ཕྱོགས་བཅུར་རྣམ་པར་བལྟས་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། ཉན་ཐོས་ཆེན་པོ་རྣམས་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་བདག་ལ་དགོངས་སུ་གསོལ།
en: Bhūteśvara, the brahmā, now with the blessing of the buddhas, directed his gaze in each of the ten directions and beseeched with folded hands, “Listen to me, O blessed buddhas, bodhisattva great beings, great hearers, gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas!

source: བདག་གི་བསམ་པ་ལ་ཆོས་ཀྱི་ཚུལ་འདི་ཡུན་རིང་དུ་གནས་པར་འགྱུར་བ་དང་། ཆོས་སྨྲ་བ་རྣམས་དང་། ཆོས་ཉན་པ་རྣམས་དང་། ནན་ཏན་དང་ལྡན་པ་རྣམས་ལ་འཚེ་བར་མི་འགྱུར་བར་འདིར་དད་པ་སྩལ་དུ་གསོལ། གང་སླད་མའི་དུས་ན་བདུད་ནས།
en: Grant your approval that my wish may come true, namely that this Dharma method will endure for a long time and that no harm will come to the Dharma teachers and students who are established in the proper conduct. Grant your approval that, during the degenerate time, no māras . . .

source: མི་དང་མི་མ་ལགས་པའི་བར་གྱིས། དེ་དག་ལ་འཚེ་བར་མི་བགྱིད་པར་དད་པ་སྩལ་དུ་གསོལ།
en: or human and nonhuman beings will be able to do any harm to them.”

source: དེ་ནས་ཚངས་པ་ཕུན་སུམ་ཚོགས་པའི་དབང་ཕྱུག་གིས་དེ་དག་གི་སྡང་བའི་སེམས་བཟློག་པ་དང་། མནས་བསྒག་པའི་ཕྱིར། དབྱངས་ཀྱི་སྒྲ་ཕྱུང་ནས། སྒྲ་དེས་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཐམས་ཅད་གང་བར་བྱས་སོ། །ཡང་དེའི་ཚེ་ཚངས་པའི་དབང་པོ་དེ་དག་ཐམས་ཅད་ཀྱིས་མགྲིན་གཅིག་ཏུ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བདག་ཅག་ཀྱང་གཟུངས་འདི་ལ་དད་པ་འབུལ་ལོ།
en: At this point, the brahmā Bhūteśvara, in order to restrain and reverse their aggressive intentions and take the pledge from the evil-minded beings, uttered a loud cry that filled the entire world sphere, and the lords of brahmās declared in one voice, “We too offer our support for the dhāraṇī.

source: །བདག་ཅག་ཉིད་ཀྱིས་ཀྱང་ཕྱི་མའི་དུས་ན་གཟུངས་འདི་གཟུང་བར་བགྱིའོ། །རབ་ཏུ་བསྟན་པར་བགྱིའོ།
en: We will ourselves uphold and teach it during the degenerate period.

source: །དམ་པའི་ཆོས་ཀྱང་བསྲུང་བར་བགྱིའོ། །ཆོས་སྨྲ་བ་དང་། ཉན་པ་དེ་དག་དང་། ནན་ཏན་དང་ལྡན་པ་དེ་དག་ཀྱང་བསྲུང་བར་བགྱིའོ།
en: We will protect the sacred Dharma and also protect the Dharma teachers and students that follow the proper conduct. Please recite it, honorable one!

source: །བདག་ཅག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། ཉན་ཐོས་ཆེན་པོ་རྣམས་ཀྱི་སྤྱན་སྔར་གཟུངས་འདི་ལ་དད་པ་འབུལ་གྱིས་སྐྱེས་བུ་དམ་པ་གསུངས་ཤིག །དེ་ནས་ཚངས་པ་ཕུན་སུམ་ཚོགས་པའི་དབང་ཕྱུག་གིས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: We declare our support for this dhāraṇī in front of the blessed buddhas, the bodhisattva great beings, and the great hearers.”

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། ཉན་ཐོས་ཆེན་པོ་རྣམས་ཀྱིས་བདག་ལ་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ། འདི་ལྟ་སྟེ། ཨ་མ་ལེ། བི་མ་ལེ། ག་ཎ་ཥ་ཎ་ཌེ། ཧ་རེ་ཙཎ་ཌེ། མ་ཧཱ་ཙཎ་ཌེ། ཙ་མེ་ཧ། ཙ་མེ། སཽ་མྱེ། སྠ་མེ། ཨཱ་བ་ཧ། བི་བ་ཧེ། ཨཾ་ག་ཛཱ་ནེ་ཏྲ། ཁ་ཁ། མཱུ་ལ་པ་རི་ཙྪེ་དེ། ཡཀྵ་ཙཎ་ཌེ། པི་ཤཱ་ཙ་ཙཎྜེ།
en: Bhūteśvara, the brahmā, again beseeched, “Give me your blessing, O holy buddhas, bodhisattva great beings, and great hearers!

source: ཨ་བརྟ་ནི། ས་མ་བརྟ་ནི། སམ་ཀ་རི་ཎི། ཛམ་བྷ་ནི། སྟམ་བྷ་ནི། མོ་ཧ་ནི། ཨུཙྪཱ་ཊ་ནི། ཧ་མ་ཧཱ། ཧ་མ་ཧཱ།
en: The dhāraṇī is:

source: མ་ཧཱ་སཾ་ཀུ་ཙ་ནེ། ཁ་ག་ཤ་བ། ཨ་མ་ལེ། ཨ་མཱུ་ལ་པ་རི་བརྟེ། ཨ་ས་ར་ཁཱ་བ་སྭཱ་ཧཱ།
en: amale vimale gaṇaṣaṇḍe hāre caṇḍe mahā­caṇḍe came mahā­came some sthāme abaha vibaha aṃgajā netrakhave mūlaparicchede yakṣa­caṇḍe piśāca­caṇḍe āvartani saṃvartani saṃkāraṇi jaṃbhani mohani ucchāṭani hamaha maha maha maha ākuṃcane khagaśava amala mūla mūla­parivartate asārakhava svāhā!

source: གསང་སྔགས་འདི་ལས་གང་འདའ་ཞིང་།
en: “Whoever transgresses against these mantras

source: །མང་པོ་ཚོགས་པར་མི་སྤྱོད་ན།
en: Will be excluded from the community—

source: །མིག་མི་མཐོང་ཞིང་མགོ་ཡང་འགས།
en: He will have his eyes taken out, his head will burst,

source: །ཡན་ལག་ཐ་དད་འཇིག་པར་འགྱུར།
en: And he will have his limbs broken.

source: ཨ་ཙ་ཙ་ཨ་བ་ཧ། ཙ་ཙ་ཙུ། ཁྲ་ཁ་ཤ་ཙ་ཊ་ཊ་ཁ་ཙ་ཙཱ་ན། ཁ་ག་ཙ་ཙ་ཙ་ཙ་ཙ་ཙ་ན་ཙ་ཧ། མཱུ་ལ་ཙ་ཙ་ཙ། མཱུ་ལ་ཙ་ཙ། ཧ་མཱུ་མུ་ལ་ཙ་ཙ་ཧ་མཱུ་ཧ་མུ།
en: acca avaha cacacu krakṣa cacaṭa kacacā nakhaga caca caca caca na ca hamūla caca camūla cacaha amūla caca hamūla mū baḍabahā svāhā!”

source: བ་ཨུ་བ་ཧ་སྭ་ཧཱ། དེ་ནས་ཚངས་པའི་དབང་པོ་ཐམས་ཅད་ནས་ཤ་ཟའི་དབང་པོའི་བར་གྱིས་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། འདི་སྐད་ཅེས་ཀྱང་སྨྲས་སོ། །སྟོབས་ཆེན་སྟོབས་ཀྱི་ཤུགས་ཤིན་ཏུ་འཇོམས་པའི་གསང་སྔགས་ཀྱི་ཚིག་འདི་བཤད་དེ། ཕན་པ་མ་ཡིན་པར་སེམས་པའི་འབྱུང་པོ་ཐམས་ཅད་ལ་ཞགས་པ་འདིས་བཏབ་ན་དེ་དག་འཚོ་བར་ག་ལ་འགྱུར།
en: Immediately, all the brahmā lords . . . and piśācas applauded and said, “These mantra words possess in excess the ability to crush the great trichiliocosm with their force and power. This noose will affix itself to all spirits who harbor ill will, so how could they survive?”

source: ཚངས་པ་ཕུན་སུམ་ཚོགས་པའི་དབང་ཕྱུག་གིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འབྱུང་པོ་གང་དག་སྡང་བའི་བསམ་པ་ཅན།
en: Bhūteśvara the brahmā said, “Those spirits who have wicked minds;

source: སྙིང་རྗེ་མེད་པ་བྱས་པ་མི་གཟོ་བ།
en: who are devoid of compassion and ungrateful;

source: སེམས་ཅན་ལ་འཚེ་བ་རྣམས་སམ། བདུད་དམ།
en: who wish to harass beings or are followers of Māra ; who seek opportunities to harm the head-anointed kṣatriya kings that have faith in the Buddha’s teaching;

source: བདུད་ཀྱི་འཁོར་གླགས་ལྟ་ཞིང་སྐབས་ཚོལ་བ་རྣམས་སངས་རྒྱས་ཀྱི་བསྟན་པ་ལ་མངོན་པར་དད་པའི་རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བ་རྣམས་ལ་སྐབས་ཚོལ་དུ་ཉེ་བར་འོང་བ་དང་། བཙུན་མོ་དམ་པ་དང་། བུ་དང་བུ་མོ་དང་། བཙུན་མོའི་འཁོར་རྣམས་དང་། བློན་པོ་དང་། ཤོར་བ་དང་། དཔུང་དམ་པ་དང་། འཁོར་རྣམས་དང་། གཞན་ཡང་སངས་རྒྱས་ཀྱི་བསྟན་པ་ལ་དད་པ་སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་རྣམས་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་དང་། ཆོས་སྨྲ་བ་དང་། ཆོས་ཉན་པ་རྣམས་དང་། དགེ་སློང་དང་། དགེ་སློང་མ་དང་བསམ་གཏན་དང་། ཁ་ཏོན་ལ་འགྲུས་པ་རྣམས་དང་། ཞལ་ཏ་བྱེད་པ་ལ་བརྩོན་པ་རྣམས་ལ་སྐབས་ཚོལ་དུ་འོང་ཞིང་ཐ་ན་སེམས་ཀྱི་སྐད་ཅིག་གཅིག་ལ་སྤུའི་ཁུང་བུ་གཅིག་ཙམ་ལ་འཚེའམ། གནོད་པར་བྱེད་དམ། འཇིགས་པར་བྱེད་དམ།
en: who approach, seeking an opportunity to harm, the chief queens, royal sons and daughters, women of the harem, ministers, military commanders, or other members of the royal court that have faith in the Buddha’s teaching; who approach, seeking an opportunity to harm, the men and women, sons and daughters, male and female lay practitioners, Dharma teachers and students, monks and nuns, practitioners who engage in meditation and recitation of prayers or in the service of their superiors—if any such spirits should disturb the aforementioned even for a single moment of mental activity or disturb, harm, or remove even a single hair from their bodies;

source: མདངས་འཕྲོག་གམ། ལུས་ལ་དབུགས་གཏོང་ངམ།
en: or if they should steal their vital energy or even breathe upon them;

source: སྡང་བའི་སེམས་ཀྱིས་བལྟ་ན།
en: or if they should thus seek, their minds full of malice, an opportunity to cause harm, such māras . . .

source: བདུད་ནས་མི་དང་མི་མ་ཡིན་པའི་བར་ལུས་དྲི་ང་བ་དེ་དག་གི་མགོ་ཚལ་པ་བདུན་དུ་འགས་སོ། །དེ་དག་གི་མིག་ཀྱང་ལོང་བར་འགྱུར། སྙིང་ཡང་སྐམས་པར་འགྱུར། ཤ་བཀྲ་ཅན་དུ་འགྱུར།
en: and human and nonhuman beings, with their bodies rotting and smelly, will have their heads burst into seven pieces, eyes gouged out, and hearts desiccated.

source: ལུས་རུལ་ཅིང་དྲི་ང་བ་དང་། རྫུ་འཕྲུལ་ཡང་ཡོངས་སུ་བྲི་བར་འགྱུར།
en: They will contract leprosy, oozing pus and stinking, and will completely lose their magical power.

source: དེ་དག་ས་གས་པར་ལྟུང་བར་འགྱུར།
en: The earth will develop crevasses beneath them, which they will fall into.

source: རླུང་གིས་ཀྱང་དེ་དག་ཕྱོགས་བཞིར་གཏོར་བར་འགྱུར། རྡུལ་གྱིས་ཀྱང་ཡོག་ནས་དེ་ཉིད་དུ་སེམས་འཁྲུགས་ཏེ་འཐོམས་པར་འགྱུར་རོ།
en: The winds will toss them in the four directions, and they will wander aimlessly, with their bodies covered in dust, mentally disturbed.

source: །གང་དག་ས་ལ་རྒྱུ་བ་དེ་དག་ནི་སའི་ཁུང་བུར་འཇུག་པར་འགྱུར་ཏེ། སའི་འོག་ཏུ་དཔག་ཚད་བརྒྱད་ཁྲི་བཞི་སྟོང་དུ་དེ་དག་གི་ཚེ་ཡོངས་སུ་ཟད་པར་འགྱུར་རོ།
en: Those who roam the earth will plunge into the crevasses in the ground eighty-four thousand leagues below the surface and will spend the remainder of their lives there.

source: །གང་དག་ཆུ་ན་རྒྱུ་བའི་འབྱུང་པོ་སྡང་བའི་སེམས་དང་ལྡན་པ། སངས་རྒྱས་ཀྱི་བསྟན་པ་ལ་མངོན་པར་མ་དད་པ། དེ་དག་སངས་རྒྱས་ཀྱི་བསྟན་པ་ལ་མངོན་པར་དད་པའི་རྒྱལ་རིགས་ནས་ཞལ་ཏ་བྱེད་པ་ལ་བརྩོན་པའི་དགེ་སློང་གི་བར་ལ་འཚེ་བའམ།
en: Aquatic beings that are wicked, have no faith in the teachings of the Buddha, and do harm to the kṣatriya kings who do have this faith, . . . or to those who engage in the service of their superiors—they also will have their heads burst into seven pieces . . .

source: གང་དག་སྔགས་ཀྱི་ཚིག་འདི་དག་ལས་འདའ་ན་དེ་དག་ཀྱང་དེ་བཞིན་དུ་མགོ་ཚལ་པ་བདུན་དུ་འགས་པ་ནས། དེ་ཉིད་དུ་དེ་དག་གི་ཚེ་ཡོངས་སུ་ཟད་པའི་བར་དུ་འགྱུར་རོ།
en: and will spend the remainder of their lives there, should they transgress against these mantras.

source: །ཡང་ཡུལ་གང་དུ་བདུད་ཀྱི་ཚོགས་ཀྱིས་མི་ཐུབ་པའི་གཟུངས་ཀྱི་ཕྱག་རྒྱའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འབྱུང་བ་དེར་བདག་ཅག་གིས་བསྲུང་བ་དང་། བསྐྱབ་པ་དང་། སྦ་བའི་སླད་དུ་སྤྲོ་བར་བགྱིའོ། །དེར་ཆོས་འདོད་པའི་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བགྱིའོ། །སྡང་བའི་གནོད་སྦྱིན་ནས་སྡང་བའི་ལུས་སྲུལ་པོའི་བར་ཐམས་ཅད་དེ་ནས་བསྐྲད་པར་བགྱིའོ།
en: “Furthermore, in whatever realm this Dharma discourse—the dhāraṇī-seal that cannot be conquered by the hosts of Māra—is disseminated, there we will eagerly apply ourselves to the cause of guarding, protecting, and preserving that realm, and we will protect all the beings there who yearn for the Dharma. We shall expel all, from hostile yakṣas to hostile kaṭapūtanas;

source: །ཡུལ་དེ་ན་འཐབ་པ་དང་། རྩོད་པ་དང་། མུ་གེ་དང་། ཕ་རོལ་གྱི་དམག་ཚོགས་དང་། དུས་མ་ལགས་པའི་ཆར་དང་། རླུང་དང་། གྲང་བ་དང་། ཚ་བ་དང་། ནད་ཐམས་ཅད་སླར་བཟློག་པར་བགྱིའོ།
en: avert the discord, quarrels, famine, invasions by foreign powers, and the unseasonable rains, storms, cold and hot spells, and disease in that land;

source: །བདེ་བ་དང་། འདུམ་པ་དང་། ལོ་ལེགས་པ་དང་། དགེ་བའི་རྩ་བ་དང་འཐུན་པ་རྣམས་བསྒྲུབ་པར་བགྱིའོ།
en: ensure the happiness, social harmony, good harvests, and all that accords with roots of virtue;

source: །ཆོས་སྨྲ་བ་རྣམས་དང་ཆོས་ཉན་པ་རྣམས་ལ་ནད་མ་མཆིས་པ་དང་། གྲགས་པ་དང་། རྙེད་པ་དང་། བསྟི་སྟང་ཆེན་པོ་ཉེ་བར་བསྒྲུབ་པར་བགྱིའོ།
en: and ensure the health, renown, material gain, and honor of the teachers and students of the Dharma.”

source: །ཡང་དེའི་ཚེ་ཚངས་པ་ཆེན་པོ་དབྱངས་དང་ལྡན་པ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་བཅུ་ལ་གནས་པ། ཚངས་པའི་ནང་དུ་ནི་ཚངས་པ་ཀུན་གྱིས་བཀུར།
en: Also at that moment, a bodhisattva great being known as Voice of Mahābrahmā, who dwelled on the tenth bhūmi, was present.

source: བདུད་ཀྱི་ནང་དུ་ནི་བདུད་ཀུན་གྱིས་བཀུར། བརྒྱ་བྱིན་གྱི་ནང་དུ་ནི་བརྒྱ་བྱིན་ཀུན་གྱིས་བཀུར་བ་ནས་དེ་བཞིན་དུ་སྦྱར་ཏེ། རྣམ་ཐོས་ཀྱི་བུ་དང་། འཕགས་སྐྱེས་པོ་དང་། མིག་མི་བཟང་དང་། ཡུལ་འཁོར་སྲུང་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། སྲེད་མེད་ཀྱི་བུ་དང་། ལྷ་མ་ཡིན་དང་། ལྷའི་དབང་པོའི་ནང་དུ་ནི་དེ་དག་ཀུན་གྱིས་བཀུར་བ།
en: He was attended by all the brahmās, māras, śakras, and so forth, as well as Vaiśravaṇa, Virūḍhaka, Virūpākṣa, Dhṛtarāṣṭra, Maheśvara, Nārāyaṇa, and the lords of the gods and asuras.

source: ཁ་དོག་བཟང་པོ་རྒྱས་པ་མཆོག་དང་ལྡན་པ།
en: He had the finest and most radiant complexion and the most exquisite ornamentation.

source: རྒྱན་དམ་པས་ལེགས་པར་བརྒྱན་པ་བུད་མེད་ཀྱི་གཟུགས་དང་། རྟགས་དང་། སྤྱོད་ལམ་གྱིས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་སྤྱན་སྔར་འདུག་སྟེ།
en: In the guise of a woman, with female characteristics and deportment, he was seated before the thus-gone Śākyamuni.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་ལག་པ་གཉིས་ན་ཡིད་བཞིན་གྱི་ནོར་བུ་རིན་པོ་ཆེ་ཐོགས་སོ།
en: As an act of venerating the blessed buddhas, he proffered a wish-fulfilling jewel in his hands.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དབྱངས་དང་ལྡན་པས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ལ་མིག་མི་འཛུམས་པར་བལྟས་ཏེ།
en: The bodhisattva great being Voice of Mahābrahmā stared at the thus-gone Śākyamuni with unblinking eyes.

source: གཞན་མ་ཡིན་པའི་དངོས་པོ་བརྗོད་དུ་མེད་པ་ཅི་ཡང་མ་ཡིན་པར་བལྟས་སོ།
en: He stared at him like he was the only thing in existence—something indescribable and unidentifiable.

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེས་ཚངས་པ་དབྱངས་དང་ལྡན་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀྱེ་ཁྱོད་མིག་མི་འཛུམས་པར་ཅི་ཡང་མ་ཡིན་པའི་བར་དུ་ང་ལ་ཅི་ཞིག་བལྟ།
en: The thus-gone Śākyamuni then asked Voice of Mahābrahmā, “Listen, why are you staring at me with unblinking eyes, as if I were the only thing in existence—something indescribable and unidentifiable?

source: ཅི་འདི་ལ་སངས་རྒྱས་ཞེས་བྱ་བ་དང་། ཅི་ཡང་མ་ཡིན་པ་ཞེས་བྱ་བའི་ཆོས་དེ་གང་ཡང་ཡོད་དམ།
en: Is there any phenomenon that can be called ‘a buddha’ or ‘unidentifiable’?

source: དེ་བཞིན་དུ་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་ཉོན་མོངས་པ་རྣམས་ཡོད་དོ་ཞེས་བྱ་བའི་མིང་གི་དངོས་པོ་ནི་རྐྱེན་གྱི་མཚན་ཉིད་དོ།
en: Likewise, the verbal elements in the statement ‘the afflictions of attachment, aggression, or delusion exist’ are merely conditional characteristics.

source: །མཚན་ཉིད་ཀྱི་རྐྱེན་ནི་མ་རིག་པའོ།
en: The condition for such characteristics is ignorance.

source: །མ་རིག་པའི་རྐྱེན་གྱིས་འདུ་བྱེད་རྣམས་ནས་འགོག་པའི་བར་དུ་རྒྱས་པར་བྱའོ། །གསོལ་པ།
en: Due to the condition of ignorance, formations proliferate until cessation.”

source: བཅོམ་ལྡན་འདས་འདི་ལྟར་མ་མཆིས་པས་ན་དེའི་སླད་དུ་མ་རིག་པ་ཞེས་གསུངས་ན།
en: “Blessed One,” responded Voice of Mahābrahmā, “if all these do not exist, why do you speak to me of ignorance?

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་མ་རིག་པ་མ་མཆིས་ན་སྲིད་པའི་ཡན་ལག་བཅུ་གཉིས་པོ་དེ་དག་ག་ལས་སྐྱེ་བར་འགྱུར།
en: Blessed One, if there were no ignorance, from what would the twelve links of existence arise?

source: ཅི་ནམ་མཁའ་ལས་སྐྱེ་ཞེས་བགྱིར་ནི་ནམ་མཁའ་ཉིད་ཀྱང་མ་མཆིས་པའོ།
en: Can we say they come from space when space itself does not exist?”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེ་དེ་བཞིན་ཏེ། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ནི་ནམ་མཁའ་ལྟ་བུའོ། །ཇི་ལྟར་ནམ་མཁའ་རྫས་མ་ཡིན། མཚན་ཉིད་མ་ཡིན། མུན་པ་མ་ཡིན། སྣང་བ་མ་ཡིན། རྟོག་པ་མ་ཡིན། རྣམ་པར་རྟོག་པ་མ་ཡིན།
en: “Noble son, that is correct,” answered the Blessed One, “for all the qualities of buddhahood are like space.

source: རྣམ་པར་རིག་པ་མ་ཡིན། གྲུབ་པ་མ་ཡིན། བརྗོད་པ་མ་ཡིན། ཅི་ཡང་མ་ཡིན་པ་ཆ་ཤས་མེད་པ། དངོས་པོ་ཐམས་ཅད་སྤངས་པ་དེ་བཞིན་དུ་རིགས་ཀྱི་བུ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་དེ་བཞིན་ཉིད་ཀྱི་ཕྱིར།
en: Just as space is immaterial, is without characteristics, is neither darkness nor light, is neither thought nor concept, cannot be created or described, is unidentifiable, has no component parts, and has nothing to do with entities, likewise, O noble son, the qualities of buddhahood are deemed to be the ultimate reality because they are suchness.

source: སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ནི་ཡང་དག་པའི་མཐས་ཡོངས་སུ་བཅད་པའོ། །བྲི་བ་མེད་པ་དང་། གང་བ་མེད་པའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ནི་ཕ་རོལ་དང་ཚུ་རོལ་ལ་རེག་པ་མེད་པའོ།
en: Because they involve no increase or decrease, the qualities of buddhahood are neither high nor low.

source: །ཆ་ཤས་མེད་པའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ནི་བརྗོད་དུ་མེད་པའོ།
en: Because they have no component parts, the qualities of buddhahood are indescribable.

source: །མི་གཡོ་ཞིང་རྣམ་པར་གཞག་པ་མེད་པའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ནི་རྫས་དང་། དངོས་པོ་དང་། མཚན་ཉིད་ཐམས་ཅད་མེད་པའོ།
en: Because they do not move and cannot be placed anywhere, the qualities of buddhahood are not material or entities, and they have no characteristics.

source: །ཚིག་གི་ལམ་དང་བྲལ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ནི་སྒྲོ་བཏགས་པ་མེད་པ་སྟེ།
en: Because they transcend verbal description, the qualities of buddhahood are not superimposed, for it is from false conceptualization that the links of existence arise.”

source: ཡང་དག་པ་མ་ཡིན་པ། ཀུན་ཏུ་རྟོག་པ་ལས་སྲིད་པའི་ཡན་ལག་རྣམས་སྐྱེས་སོ། །བསྟན་པ་འདི་བཤད་པའི་ཚེ་སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: When he gave this teaching, eighty-four thousand beings developed the mind directed toward unsurpassed and perfect awakening.

source: །དེ་ནས་བདུད་སྡིག་ཅན་གྱིས་གསོལ་པ། གལ་ཏེ་སངས་རྒྱས་ཀྱི་ཆོས་ནམ་མཁའ་ལྟ་བུར་དངོས་པོ་མ་མཆིས་ཤིང་བརྗོད་དུ་མ་མཆིས་པ་ལགས་ན། དེ་ཅིའི་སླད་དུ་ཡེ་ཤེས་དང་། བརྩོན་འགྲུས་དང་། ཐབས་དང་། ཕ་རོལ་གནོན་པས་ཁྱོད་འདི་ལྟར་བདག་ལ་འཚེ།
en: Then Māra , the evil one, demanded, “If the qualities of buddhahood are indescribable non-entities, like space, then why do you harm me in this way—oppressing me with wisdom, diligence, means, and courage?

source: བདག་གི་བདུད་ཡུལ་འཇོམས།
en: Why do you destroy my Māra domain?

source: བདག་གི་བདུད་ཀྱི་ཡུལ་ནས་སེམས་ཅན་ཁ་འདྲེན།
en: Why do you lead beings from my Māra domain?

source: འགྲོ་བ་མེད་པ་དང་། འོང་བ་མེད་པ་དང་། ཅི་ཡང་མ་ཡིན་པའི་སྒྱུ་མ་ལ་སློབ་ཏུ་འཛུད་པ།
en: Why do you instruct them in the nature of illusion, which neither comes nor goes nor is identifiable in any way?

source: གང་གི་ཚེ་སེམས་ཅན་འདི་དག་ཁྱོད་ཀྱིས་བསླབ་པ་ལ་སློབ་པ་ན་དེ་དག་ལ་ཉོན་མོངས་པ་སྐྱེ་བའི་སྤྱོད་པ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ངོ་། །གང་གི་སླད་དུ་ཁྱོད་ཀྱིས་བདག་གི་སླད་དུ་གྲངས་མེད་དཔག་ཏུ་མེད་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། ཉན་ཐོས་ཆེན་པོ་རྣམས་དང་། ཚངས་པ་ཆེན་པོ་རྣམས་དང་། བརྒྱ་བྱིན་དང་། འཇིག་རྟེན་སྐྱོང་བ་བཞི་དང་། དབང་ཕྱུག་ཆེན་པོ་རྣམས་དང་། རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བའི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་བསྡུས་ནས། སངས་རྒྱས་ཀྱི་ཞིང་མ་ལུས་པ་འདི་དག་གང་བར་བགྱིས།
en: When you guide beings in these trainings, no conduct that produces the afflictions can be seen in them. For what reason are you assembling all these countless, infinite blessed buddhas, bodhisattva great beings, great hearers, great brahmās, śakras, four world protectors, maheśvaras, and gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas who have magical might and power, thus filling all the buddha fields, to go against me?

source: སྙིང་རྗེ་མེད་པ་འདིས་ཀྱང་གང་དག་ཐོས་མ་ཐག་ཏུ་བདག་ཀླད་པའི་ནད་མི་བཟད་པས་བཏབ་སྟེ།
en: Anyone who hears of this cruel act will be immediately struck with a splitting headache;

source: སྡུག་བསྔལ་གྱི་ཚོར་བ་མྱོང་ཞིང་།
en: their bodies will decompose and begin to stink.

source: ལུས་ཀྱང་རུལ་ལ་དྲི་ང་བར་གྱུར་པ་དེ་འདྲ་བའི་གསང་སྔགས་ཀྱི་ཚིག་རྣམས་བཤད།
en: Such is the mantra that you have spoken.”

source: ཡང་དེའི་ཚེ་བདུད་དྲུག་ཁྲི་བརྒྱད་སྟོང་དང་། བདུད་ཀྱི་འཁོར་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དང་། དེ་བཞིན་དུ་སྡང་བའི་གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། གྲུལ་བུམ་དང་། ཤ་ཟ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་མགྲིན་གཅིག་ཏུ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བདག་ཅག་ཀྱང་ཐོས་མ་ཐག་ཏུ་ཀླད་པ་ན་བར་གྱུར་ཏེ། ལུས་ཀྱང་རུལ་ཞིང་དྲི་ང་བར་གྱུར་ནས་ཤིན་ཏུ་སྡུག་བསྔལ་བའི་ཚོར་བ་མྱོང་ངོ་། །དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: At that moment, sixty-eight thousand māras, a countless infinitude of their retainers, and all the hostile yakṣas, rākṣasas, kumbhāṇḍas, and piśācas all declared with one voice, “As soon as we heard it, we too got headaches. Our bodies started decomposing, began to stink, and we suffered terribly.”

source: །སྡིག་ཅན་ཁྱོད་ཀྱིས་འདས་པ་དེ་དྲན་པར་བྱོས་ཤིག །ང་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པའི་ཚེ།
en: “Evil ones, remember what happened in the past!” countered the thus-gone Śākyamuni.

source: ཁྱོད་ཀྱིས་ང་བསད་པའི་ཕྱིར་དཔག་ཚད་བརྒྱད་ཅུ་ཚུན་ཅད་ཀྱི་ས་དང་ནམ་མཁའ་བདུད་ཀྱི་སྡེས་བཀང་སྟེ་འོངས་པ་ནས།
en: “When I was sitting at the seat of awakening, you filled the area and the sky around me out to eighty leagues with the hordes of Māra , intent on killing me.

source: ད་ལྟར་བདུད་བྱེ་བ་འཁོར་དང་བཅས་ཏེ་ང་བསད་པའི་བར་དུ་བཀྱེ་བས།
en: And since that time you still send billions of māras and their retainers to kill me.

source: དེ་བས་ན་ཁྱོད་ཡོངས་སུ་གདུལ་བ་དང་། ཞི་བར་བྱ་བ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བ་དང་། དེ་བཞིན་དུ་བདུད་གཞན་རྣམས་ནས།
en: Therefore, I have amassed a countless infinitude of blessed buddhas, bodhisattvas, and so forth, as well as human and nonhuman beings, in order to tame, pacify, and end your torment.

source: མི་དང་མི་མ་ཡིན་པའི་བར་དུ་གདུལ་བ་དང་། ཞི་བར་བྱ་བ་དང་། སྡུག་བསྔལ་ཐམས་ཅད་ཉེ་བར་ཞི་བར་བྱ་བ་དང་། འོང་བ་དང་འགྲོ་བ་མེད་པ།
en: I have done so in order to tame, pacify, and end all the suffering of other māras, and so forth, as well as human and nonhuman beings. I have done this to instruct them in the nature of illusion, which neither comes nor goes nor is identifiable in any way.

source: ཅི་ཡང་མ་ཡིན་པའི་སྒྱུ་མ་ལ་བསླབ་པར་བྱ་བ་དང་། འགྲོ་བ་ཐམས་ཅད་དུ་འཆི་འཕོ་དང་། སྐྱེ་བའི་འཁོར་བའི་ཆུ་ཀུན་བསྐམ་པ་དང་། ཕུང་པོའི་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བའི་ཕྱིར། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་ནས། མི་དང་མི་མ་ཡིན་པའི་བར་རྣམས་བསོགས་ཀྱིས།
en: I have done so to dry up the river of saṃsāra in which all beings die and are reborn, and to help them reach the expanse of nirvāṇa without any remainder of the aggregates.

source: སྡིག་ཅན་ཁྱོད་ད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིག །དེ་ལྟར་ན་ཁྱོད་ཀླད་པ་ན་བའི་སྡུག་བསྔལ་མི་བཟད་པའི་ཚོར་བ་འདི་ལས་ཐར་བར་འགྱུར་ཏེ། མཐར་གྱིས་སངས་རྒྱས་ཀྱི་ཆོས་ནམ་མཁའི་རང་བཞིན་ལྟ་བུ་མངོན་དུ་འགྱུར།
en: “Evil ones, you should develop the mind directed toward unsurpassed and perfect awakening right now! If you do so, you will immediately be freed from this unbearably painful headache, and ultimately you will actualize the qualities of buddhahood, which have the nature of space.

source: བདུད་ཀྱི་ཡུལ་ལས་ཆེས་ཁྱད་པར་དུ་འཕགས་པའི་སངས་རྒྱས་ཀྱི་ཡུལ་རྣམས་ཀྱང་ཐོབ་པར་འགྱུར་རོ།
en: You will even gain the superior domain of the buddhas, which far exceeds that of the māras.”

source: །ཡང་དེའི་ཚེ་བདུད་དྲུག་ཁྲི་བརྒྱད་སྟོང་དང་། བདུད་ཀྱི་འཁོར་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དང་། སྡང་བའི་གནོད་སྦྱིན་ནས་ལུས་སྲུལ་པོ་སྡང་བའི་བར་གྱིས་མགྲིན་གཅིག་ཏུ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བདག་ཅག་གིས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་བགྱི་ན། ཇི་ལྟར་བདག་ཅག་སངས་རྒྱས་ཀྱི་ཆོས་ནམ་མཁའི་རང་བཞིན་ལྟ་བུ་དེ་དག་མངོན་དུ་འགྱུར། ཐམས་ཅད་ལས་ཁྱད་པར་དུ་འཕགས་པའི་སངས་རྒྱས་ཀྱི་ཡུལ་འདི་ཡང་ཐོབ་པར་འགྱུར།
en: The sixty-four thousand māras, the countless infinitude of their retainers, and the hostile yakṣas, and so forth, as well as the hostile kaṭapūtanas, all declared with one voice, “When we develop the mind directed toward unsurpassed and perfect awakening, we shall actualize the qualities of buddhahood, which have the nature of space, and win the domain of the buddhas as well, superior above all.”

source: དེ་ནས་བདུད་སྡིག་ཅན་གྱིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །གལ་ཏེ་བདག་ཕྱི་མའི་མཐའི་མུའི་བར་དུ་ཀླད་པ་ན་བར་གྱུར་ཀྱང་། བདག་འདི་འདྲ་བའི་གཡོ་སྒྱུས་བྱང་ཆུབ་ཏུ་སེམས་མི་སྐྱེད་དོ།
en: “Even if I were to have a headache until the end of time,” insisted Māra , the evil one, “I would never let such cunning make me develop the mind directed toward awakening.”

source: །དེ་ནས་ཚངས་པ་ཆེན་པོ་དབྱངས་དང་ལྡན་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བདག་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱི་སྤྱན་སྔར་བསྟན་པའི་ཆོས་ཀུན་གཟུང་བར་སྤྲོའོ།
en: Voice of Mahābrahmā then declared, “I will also joyfully uphold all the Dharma teachings that have been taught before all the blessed buddhas here in this buddha field.

source: །སངས་རྒྱས་ཀྱི་ཞིང་སྙིགས་མ་ལྔ་ཅན་འདིར་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་འདིའི་བསྟན་པ་ལ་གཙོ་བོས་གཏད་པ་གཟུང་བར་བགྱི་སྟེ།
en: I will uphold the teachings of the thus-gone Śākyamuni in this buddha field rife with the five degenerations, holding them as the most important.

source: ད་ཡང་ཤཱཀྱ་ཐུབ་པའི་ཉི་མ་ནུབ་ཀྱི་བར་དུ་བདག་གིས་བསྟན་པ་འདི་ལ་ཆོས་ཀྱི་ཚུལ་འབར་བར་བགྱིའོ།
en: I will make this teaching—this Dharma method—shine until Śākyamuni’s own sun sets.

source: །ཡུལ་གང་ན་བདུད་ཀྱི་ཚོགས་ཀྱིས་མི་ཐུབ་པའི་གཟུངས་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་མ་བྱུང་བ་དེར་བདག་གིས་འབྱུང་བར་བགྱིའོ།
en: I will bring the Dharma discourse of this dhāraṇī, which cannot be defeated by the hosts of Māra, to all lands where it has not previously spread.

source: །གང་དུ་བྱུང་བ་དེར་ནི་ཤིན་ཏུ་ལྷག་པར་འབྱུང་བར་བགྱིའོ།
en: And wherever it appears, I will ensure that it flourishes.

source: །གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ཡུལ་དེ་དག་ན་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་གང་དག་མཆིས་པ་དེ་དག་ཀྱང་བསྲུང་བར་བགྱི།
en: I will defend all the noble sons and daughters in all the towns, villages, cities, and countries.
